# 관세청 수출입 무역통계 가공 데이터

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print('Heello')

Heello

In [2]:
import os
csv_file_path = os.getenv("HOME")+'/aiffel/data_preprocess/data/trade.csv'
trade = pd.read_csv(csv_file_path)
trade.head()

          기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지  기타사항
0  2015년 01월  중국  116932.0  12083947.0  334522.0  8143271.0  3940676.0   NaN
1  2015년 01월  미국   65888.0   5561545.0  509564.0  3625062.0  1936484.0   NaN
2  2015년 01월  일본   54017.0   2251307.0   82480.0  3827247.0 -1575940.0   NaN
3  2015년 02월  중국   86228.0   9927642.0  209100.0  6980874.0  2946768.0   NaN
4  2015년 02월  미국   60225.0   5021264.0  428678.0  2998216.0  2023048.0   NaN

## 결측치<br>
* 결측치 데이터 제거<br>
* 결측치 대체<br>

In [3]:
print('전체 데이터 건수:', len(trade))

전체 데이터 건수: 199

In [4]:
trade.count()

기간      199
국가명     199
수출건수    196
수출금액    195
수입건수    196
수입금액    196
무역수지    195
기타사항      0
dtype: int64

In [5]:
print('컬럼별 결측치 개수')
len(trade)-trade.count()

컬럼별 결측치 개수

기간        0
국가명       0
수출건수      3
수출금액      4
수입건수      3
수입금액      3
무역수지      4
기타사항    199
dtype: int64

In [6]:
trade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   기간      199 non-null    object
 1   국가명     199 non-null    object
 2   수출건수    196 non-null    float64
 3   수출금액    195 non-null    float64
 4   수입건수    196 non-null    float64
 5   수입금액    196 non-null    float64
 6   무역수지    195 non-null    float64
 7   기타사항    0 non-null      float64
dtypes: float64(6), object(2)
memory usage: 12.6+ KB

In [7]:
# 기타사항 : 전부 결측치 = 아무 정보 없는 컬럼 >>DEL
trade = trade.drop('기타사항', axis=1)
trade.head()

          기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
0  2015년 01월  중국  116932.0  12083947.0  334522.0  8143271.0  3940676.0
1  2015년 01월  미국   65888.0   5561545.0  509564.0  3625062.0  1936484.0
2  2015년 01월  일본   54017.0   2251307.0   82480.0  3827247.0 -1575940.0
3  2015년 02월  중국   86228.0   9927642.0  209100.0  6980874.0  2946768.0
4  2015년 02월  미국   60225.0   5021264.0  428678.0  2998216.0  2023048.0

### 결측치가 있는 행 찾기 <br>
* DataFrame.isnull() : 데이터마다 결측치 여부 True, False 반환<br>
* DataFrame.any(axis=1) : 행에 하나라도 True있으면 True 아니면 False반환

In [8]:
trade.isnull()

        기간    국가명   수출건수   수출금액   수입건수   수입금액   무역수지
0    False  False  False  False  False  False  False
1    False  False  False  False  False  False  False
2    False  False  False  False  False  False  False
3    False  False  False  False  False  False  False
4    False  False  False  False  False  False  False
..     ...    ...    ...    ...    ...    ...    ...
194  False  False  False  False  False  False  False
195  False  False  False  False  False  False  False
196  False  False   True   True   True   True   True
197  False  False   True   True   True   True   True
198  False  False   True   True   True   True   True

[199 rows x 7 columns]

In [9]:
trade.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
194    False
195    False
196     True
197     True
198     True
Length: 199, dtype: bool

In [10]:
trade[trade.isnull().any(axis=1)]

            기간 국가명      수출건수  수출금액       수입건수       수입금액  무역수지
191  2020년 04월  미국  105360.0   NaN  1141118.0  5038739.0   NaN
196  2020년 06월  중국       NaN   NaN        NaN        NaN   NaN
197  2020년 06월  미국       NaN   NaN        NaN        NaN   NaN
198  2020년 06월  일본       NaN   NaN        NaN        NaN   NaN

In [11]:
# 196, 97,98은 모든 금액이 NaN이므로 삭제가 바람직
# dropna : 결측치 삭제 (how = all - 전부결측치일 경우 삭제, any - 하나라도 결측치일 경우 삭제)
trade.dropna(how='all', subset=['수출건수', '수출금액', '수입건수', '수입금액', '무역수지'], inplace=True)
print("👽 It's okay, no biggie.")

👽 It's okay, no biggie.

In [13]:
trade.shape

(196, 7)

### 결측치 채우기

In [14]:
trade[trade.isnull().any(axis=1)]

            기간 국가명      수출건수  수출금액       수입건수       수입금액  무역수지
191  2020년 04월  미국  105360.0   NaN  1141118.0  5038739.0   NaN

index 191과 같이 수치형 데이터를 보완할 방법은 많습니다.

1. 특정 값을 지정해줄 수 있습니다. 그러나 결측치가 많은 경우, 모두 같은 값으로 대체한다면 데이터의 분산이 실제보다 작아지는 문제가 생길 수 있습니다.

2. 평균, 중앙값 등으로 대체할 수 있습니다. 1번에서 특정 값으로 대체했을 때와 마찬가지로 결측치가 많은 경우 데이터의 분산이 실제보다 작아지는 문제가 발생할 수 있습니다.

3. 다른 데이터를 이용해 예측값으로 대체할 수 있습니다. 예를 들어 머신러닝 모델로 2020년 4월 미국의 예측값을 만들고, 이 값으로 결측치를 보완할 수 있습니다.

4. 시계열 특성을 가진 데이터의 경우 앞뒤 데이터를 통해 결측치를 대체할 수 있습니다. 예를 들어 기온을 측정하는 센서 데이터에서 결측치가 발생할 경우, 전후 데이터의 평균으로 보완할 수 있습니다.

In [15]:
# 4번 방법으로 보완
trade.loc[[188,191,194]]

            기간 국가명      수출건수       수출금액       수입건수       수입금액       무역수지
188  2020년 03월  미국   97117.0  7292838.0  1368345.0  5388338.0  1904500.0
191  2020년 04월  미국  105360.0        NaN  1141118.0  5038739.0        NaN
194  2020년 05월  미국  126598.0  4600726.0  1157163.0  4286873.0   313853.0

In [20]:
# index로 접근
# 수출금액 (평균) = (이전달+다음달)/2
trade.loc[191,'수출금액'] = (trade.loc[188,'수출금액'] + trade.loc[194,'수출금액'])/2
trade.loc[[191]]

            기간 국가명      수출건수       수출금액       수입건수       수입금액  무역수지
191  2020년 04월  미국  105360.0  5946782.0  1141118.0  5038739.0   NaN

In [21]:
# 무역수지 = 수출 -수입
trade.loc[191, '무역수지'] = trade.loc[191, '수출금액'] - trade.loc[191, '수입금액'] 
trade.loc[[191]]

            기간 국가명      수출건수       수출금액       수입건수       수입금액      무역수지
191  2020년 04월  미국  105360.0  5946782.0  1141118.0  5038739.0  908043.0

In [59]:
# why not and??
[(trade['기간']== '2019년 4월') & (trade['국가명']== '미국')]

[0      False
 1      False
 2      False
 3      False
 4      False
        ...
 191    False
 192    False
 193    False
 194    False
 195    False
 Length: 196, dtype: bool]

# 중복된 데이터

In [54]:
# 중복데이터 확인
trade.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
191    False
192    False
193    False
194    False
195    False
Length: 196, dtype: bool

In [55]:
trade[trade.duplicated()]

            기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
187  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0

In [60]:
trade[(trade['기간']=='2020년 03월')&(trade['국가명']=='중국')]

            기간 국가명      수출건수        수출금액      수입건수       수입금액       무역수지
186  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0
187  2020년 03월  중국  248059.0  10658599.0  358234.0  8948918.0  1709682.0

### DataFrame.drop_duplicates 이용 중복데이터 삭제

In [61]:
trade.drop_duplicates(inplace=True)
print("it's ok")

it's ok

In [62]:
df = pd.DataFrame({'id':['001', '002', '003', '004', '002'], 
                   'name':['Park Yun', 'Kim Sung', 'Park Jin', 'Lee Han', 'Kim Min']})
df

    id      name
0  001  Park Yun
1  002  Kim Sung
2  003  Park Jin
3  004   Lee Han
4  002   Kim Min

In [63]:
# subset : 처리할 열, keep : first or last 제외하고 처리
df.drop_duplicates(subset=['id'],keep='last')

    id      name
0  001  Park Yun
2  003  Park Jin
3  004   Lee Han
4  002   Kim Min

## 이상치 (Outlier)

가장 먼저 생각해 볼 수 있는 간단하고 자주 사용되는 방법은 평균과 표준편차를 이용하는 z score 방법입니다.
평균을 빼주고 표준편차로 나눠 z score
(
X
−
μ/
σ
)
를 계산합니다. 그리고 z score가 특정 기준을 넘어서는 데이터에 대해 이상치라고 판단합니다. 기준을 작게 하면 이상치라고 판단하는 데이터가 많아지고, 기준을 크게 하면 이상치라고 판단하는 데이터가 적어집니다.  
이상치를 판단한 뒤 어떻게 해야 할까요?

1. 가장 간단한 방법으로 이상치를 삭제할 수 있습니다. 이상치를 원래 데이터에서 삭제하고, 이상치끼리 따로 분석하는 방안도 있습니다.

2. 이상치를 다른 값으로 대체할 수 있습니다. 데이터가 적으면 이상치를 삭제하기보다 다른 값으로 대체하는 것이 나을 수 있습니다. 예를 들어 최댓값, 최솟값을 설정해 데이터의 범위를 제한할 수 있습니다.

3. 혹은 결측치와 마찬가지로 다른 데이터를 활용하여 예측 모델을 만들어 예측값을 활용할 수도 있습니다.

4. 아니면 binning을 통해 수치형 데이터를 범주형으로 바꿀 수도 있습니다.

In [66]:
# abs(): 절대값
# z- score 함수 만들기
# df[abs(df[col] - np.mean(df[col]))/np.std(df[col])>z].index: 
# 값이 z보다 큰 데이터의 인덱스를 추출
def outlier(df, col, z):
    return df[abs(df[col]-np.mean(df[col]))/np.std(df[col]>z)].index
print("it's ok")

it's ok